// ობიექტქები !!!!!!!!!!!!!!!!!!!!!!!!!!!!!
var object = {
    "1": "ორშაბათი",
    "2": "სამშაბათი",
    "3": "ოთხშაბათი",
    "4": "ხუთშბათი",
    "5": "პასარსკევი",
    "6": "შაბათი",
    "7": "კვირა",
}
console.log(object);


// ობიექტის გამოტანა სხვა ცვლადიდიან
var obj = {
    "9name": 10,
    "key7": 20,
    "a-b": 30,
    "city10": 40,
    "city 10": 50,
}
// ვქმნით ახალ ცვლადს და მნიშვნელობაში ვანიჭებთ ობიექტის იმ გასაღების სახელს რომელზეც გვინდა წვდმოის განხორციელება
var newObj = "key7"
console.log(obj?.[newObj])
// ვიძახებთ ობიქტის სახელი > ?. კითვის ნიშანი და წერტილი მინშნავს რომ თუ პროგრამამ აღმოაჩინა შეცდომა, 
// შეცდომა უგულებელყვოს და მუშაობა გააგრძლელოს უხარვეზოდ / შესაძლოა შეცდმოის აღმოჩენს შემთხვევაში მთელი პროგრამამ ერორი გამოიტანოს


// get და set ფუნქციები > get- ობიექტის გასაღებებზე წვდომის განხორციელების საშუალება გვაქვს
// set ფუქნცია > set-  გასაღებისთვის მნიშვნელობის მინიჭება


// გასაღებში ფუნქციის შექმნა:

var newObject = {
    key1 : "HELLO",
    key2 : "WOLRD",
    key3 : 6,
    keY4 : "OK",
    fInKey : function(){
        console.log( "function in key");
    }
}
newObject.fInKey()


// გასაღებში შექმნილ ფუნქციაში მშობელი ობიეტის გასაღებების გამოძახება
// this. საკვანძო სიტყვა იძახებს გასაღებებზე ფუქციაში / 
// მეორე საშუალება ამისთვის არის : ობიექტის სახელი.გასაღების სახელი - მაგრამ ეს მიდგომა სინტაქსურად არასწორია
var newObject = {
    key1 : "HELLO",
    key2 : "WOLRD",
    key3 : 6,
    keY4 : "OK",
    fInKey : function(){
        console.log(this.key3);
    }
}
newObject.fInKey()


// arrow ფუქნცია ობიექტებში
// arrow ფუქნციაში => this. საკვანძო სიტყვის ნაცვლად გასაღებების გამოძახება ხდება უშუალოდ ობიეტის სახელით და იმ გასაღების სახელით რომლის გამოძახებაც გვსურს 
var newObject = {
    key1 : "HELLO",
    key2 : "WOLRD",
    key3 : 6,
    keY4 : "OK",
    fInKey : () => {
        console.log(newObject.key3);
    }
}
newObject.fInKey()


// aroow ფუნქცია ობიექტებში
var newObject = {
    key1 : "HELLO",
    key2 : "WOLRD",
    key3 : 6,
    keY4 : "OK",
    fInKey : () => {
        console.log("ჰელლო ჯიმა");
    }
}
newObject.fInKey()




// მათემატიკური ამოცანა > ობიექტში შექმნილ ფუქნციაში
var newObject = {
    key1 : "HELLO",
    key2 : "WOLRD",
    key3 : 6,
    keY4 : "OK",
    fInKey : (y) => {
        return y * 5;
    }
}
console.log(newObject.fInKey(2));


// spread მეთოდით ... სამი წერტილი ხდება ობიექტების კოპირება და ახალ ობიქტში გადმოტანა
var obj1 = {
    name : "malkhaz",
}
var obj2 = {
    ...obj1,
    surname : "okriashvili",
}
var objUnite = {...obj1, ...obj2}
console.log(objUnite, obj2);


// ობიექტში ობიექტის ჩაშენება
//  ვქმნით ობიექტს და ახალ ობიექტს ვაშენებთ გასაღებში
var main = {
    child : grangChild = {
        obj : "object build inside the objects key"

    }
}
console.log(main.child);
// მისი გამოძხება კი ხდება მთავარი ობიექტის სახელი > წერტილი > შვილი ობიექტის სახელი


// ობიექტის დესტრუქცია - დახლეჩვა
// დესქტუქცია არის ობიეტის დახლეჩვა რათა გამოვიტანოთ მათი მნშნვნელობები
// სათითაოდ ცვლადებში მათი მნიშვნელობის მინიჭების ნაცვლად ვქმნით ერთ ცვლადს სადაც გვაქვს უამრავი საცავი რომელსაც ვუტოლებთ ობიექტს > 
//  საცავებს = გასაღების მსგავსი სახელი უნდა დავარქვათ   
var des = {
    name : "malkhaz",
    lastname : "okriashvili",
    number : "551-58-99-32",
    mail : "okriashvili.malhaz@gmail.com"
} 
var {name, lastame, mail, number} = des
console.log(number);
// ერთი ცვლადი შევქმენით რომელიც გავუტოლეთ ობიექტს და შიგ გვაქვს რამდენი მონაცემთა საცავი
// იმის ნაცვლად რომ შეგვექმნა ცვლადები შევქმენუთ ერთი ცვლადი


// get და set მეთოდები ობიექტში
// get - მეთოდი წვდომას ახორცეილებს ობიექტში არსებულ გასაღებებზე და გამოაქვს ისინი
var ob = {
    name : "malkhaz",
    lastname : "okriashvili",
    number : "551-58-99-32",
    mail : "okriashvili.malhaz@gmail.com",

    get printName() {
        return this.name;
    },

    set setName(m) {
        this.number = m;
    }
}
ob.setName = "211100341@ibsu.edu.ge";
console.log(ob.number);
console.log(ob.printName);
// set - მეთოდი კი არსებულ გასაღების მნიშნვნელობას ანაცვლებს
// set ის ფუქნციას მინიმუმ ერთი პარამეტრი მაინც უნდა გადავცეთ და ფუნქცია უნდა გავუტოლოთ იმ მნიშვნელობას რითიც გვინდა ჩანაცვლება

//ობიექტში შევქმენით ქუნქცია და გავუწერეთ საკვანძო სიტყვა get/ დასრულების შემდეგ კი ობიექტი და ფუნცქია გამოვიძახე
//მსგავსი სინტაქსი აქვს set ფუნქციასაც / ფუნქცია უნდა გადავცეთ თვისების სახით და არა ფუქნციის სახით ანუ () ფუნქციის შემდგომ აღარ უნდა მივუწეროთ


// ციკლები ობიექტებში!!!!!!!!!!!!!!!!!!!!!!!1
// შევქმნათ ვიმნე პიროვნების მონაცემები

var person = {
    name : "ნინია",
    lastame : "ბერიძე",
    id : 15002341268,
    weight : "79kg",
    height : "182cm",
    age : 29,
    password : "Igriale-oqro",
}
// ობიექტებთან სამუშაოდ ვიყენებთ for ციკლს
// სინტაქსი : ვაცხადებთ for() ციკლს რომელშიც ვქმნით ცვლადს და საკვანძო სიტყვა "in" ით ვუთითებთ რომელ ობიექტსაც უნდა ემუშაოს, ობიექტის სახელს
for(var key in person) {
    console.log(key); 
    console.log(person[key]);
}

// შექმნილი ცვლადი ემუშავება უშუალოდ გასაღებებს
// key ცვლადი გამოიტანს უშუალოდ გასაღებებს 
// ხოლო person[key] კი უშუალოდ გასაღებების მნიშვნელობას გამოიტანს



















// // შექმენით ობიექტი date, რომლის გასაღებები იქნება day, month და year. მათ მნიშვნელობებად მიმდინარე
// // თარიღი განსაზღვრეთ. ეკრანზე გამოიტანეთ ეს თარიღი.
// var n = new Date();
// var date = {
//     day : n.getDate(),
//     month : n.getMonth(),
//     year : n.getFullYear(),
// }
// console.log(date.day + '/' + date.month + '/' + date.year);



// var y = new Date
// console.log(y.getFullYear());



// // მიმდინარე თარიღის მიღება
// let now = new Date();

// // ობიექტი day, month, year გასაღებით
// let date = {
//   day: now.getDate(),
//   month: now.getMonth() + 1, // getMonth() აბრუნებს 0-დან 11-მდე, ამიტომ ვამატებთ 1-ს
//   year: now.getFullYear()
// };

// // ეკრანზე გამოტანა
// console.log("დღე:", date.day);
// console.log("თვე:", date.month);
// console.log("წელი:", date.year);










const male = {
    name: "ვაჟა ცხადაზე",
    gender: "მამრობითი",
};

const dob = {
    date_of_birth: "2011",
};
console.log([...person], [...dob])

const person1 = {
    name: "ვაჟა ცხადაზე",
    gender: "მამრობითი",
};

var {name, gender} = person1











// ობიექტების დავალება !!!!!!!!!!!!!!
// დავალება 1:
// შექმენით ობიექტი გასაღებებით 1-დან 12-მდე და თვეების დასახელებების მნიშვნელობებით. მიღებული
// ობიექტი კონსოლზე გამოიტანეთ.
var months = {
    1 : january,
    2 : february,
    3 : march,
    4 : april,
    5 : may,
    6 : june,
    7 : jule,
    8 : august,
    9 : september,
    10 : october,
    11 : november,
    12 : december,
}
console.log(months);


// დავალება 2:
// შექმენით ობიექტი person, რომლის გასაღებები იქნება 'სახელი', 'გვარი' და 'გენდერი'. მათი მნიშვნელობები
// თქვენ თვითონ განსაზღვრეთ. ეკრანზე გამოიტანეთ სახელი გვარის და გენდერის მნიშვნელობები ერთ
// სტრინგში. სიტყვები ერთმანეთს დააცილეთ და გენდერი ფრჩხილებში ჩასვით.
// მაგ: 'ნატო შონია (მდედრობითი)'
var person = {
    saxeli : "მალხაზ",
    gvari : "ოქრიაშვილი", 
    sqesi : "მამრობითი",
}
console.log(person.saxeli + " " + person.gvari + " " + "(" + person.sqesi + ")");



// .fill მეთოდი აწ უკვე არესბულ მასივებს ავსებს სხვა ელემენტით / თუ დიაპაზონის მნიშვნელობას არ გავუწერთ ყველა ელემენტს შესავცებს
// სინტაქსი : x.fill
var x = ["giorgi", "ana", "lasho", "nik"]
x.fill("makho", 1, 3)
console.log(x);



var num = "200"
console.log(num - 8)